#+COLUMNS: %50ITEM(Task) %7TODO %14CLOCKSUM(Clock)

* Organisation
** DONE [#A] Basic Setup [7/7]
:LOGBOOK:
CLOCK: [2023-11-15 Wed 08:25]--[2023-11-15 Wed 08:28] =>  0:03
CLOCK: [2023-11-14 Tue 21:26]--[2023-11-14 Tue 21:41] =>  0:15
CLOCK: [2023-11-14 Tue 19:32]--[2023-11-14 Tue 20:30] =>  0:58
CLOCK: [2023-11-14 Tue 18:01]--[2023-11-14 Tue 19:15] =>  1:14
CLOCK: [2023-11-14 Tue 11:06]--[2023-11-14 Tue 11:23] =>  0:17
CLOCK: [2023-11-14 Tue 10:01]--[2023-11-14 Tue 10:57] =>  0:56
CLOCK: [2023-11-14 Tue 08:25]--[2023-11-14 Tue 09:25] =>  1:00
CLOCK: [2023-11-14 Tue 08:15]--[2023-11-14 Tue 08:19] =>  0:04
CLOCK: [2023-11-14 Tue 07:37]--[2023-11-14 Tue 07:53] =>  0:16
CLOCK: [2023-11-14 Tue 07:06]--[2023-11-14 Tue 07:35] =>  0:29
CLOCK: [2023-11-13 Mon 16:55]--[2023-11-13 Mon 17:49] =>  0:54
CLOCK: [2023-11-13 Mon 09:58]--[2023-11-13 Mon 10:38] =>  0:40
CLOCK: [2023-11-13 Mon 09:11]--[2023-11-13 Mon 09:40] =>  0:29
CLOCK: [2023-11-13 Mon 07:03]--[2023-11-13 Mon 07:34] =>  0:31
CLOCK: [2023-11-12 Sun 18:42]--[2023-11-12 Sun 19:24] =>  0:42
CLOCK: [2023-11-12 Sun 17:05]--[2023-11-12 Sun 18:17] =>  1:12
CLOCK: [2023-11-12 Sun 09:48]--[2023-11-12 Sun 10:16] =>  0:28
CLOCK: [2023-11-11 Sat 17:35]--[2023-11-11 Sat 17:58] =>  0:23
CLOCK: [2023-11-11 Sat 10:21]--[2023-11-11 Sat 11:26] =>  1:05
CLOCK: [2023-11-11 Sat 08:33]--[2023-11-11 Sat 09:13] =>  0:40
CLOCK: [2023-11-11 Sat 01:05]--[2023-11-11 Sat 01:08] =>  0:03
CLOCK: [2023-11-11 Sat 00:51]--[2023-11-11 Sat 01:05] =>  0:14
CLOCK: [2023-11-10 Fri 23:06]--[2023-11-11 Sat 00:47] =>  1:41
CLOCK: [2023-11-10 Fri 21:42]--[2023-11-10 Fri 22:48] =>  1:06
CLOCK: [2023-11-10 Fri 21:20]--[2023-11-10 Fri 21:26] =>  0:06
CLOCK: [2023-11-10 Fri 20:45]--[2023-11-10 Fri 21:16] =>  0:31
CLOCK: [2023-11-10 Fri 19:36]--[2023-11-10 Fri 20:13] =>  0:37
CLOCK: [2023-11-10 Fri 11:52]--[2023-11-10 Fri 12:38] =>  0:46
CLOCK: [2023-11-10 Fri 11:40]--[2023-11-10 Fri 11:47] =>  0:07
CLOCK: [2023-11-10 Fri 10:53]--[2023-11-10 Fri 11:24] =>  0:31
CLOCK: [2023-11-10 Fri 10:24]--[2023-11-10 Fri 10:44] =>  0:20
CLOCK: [2023-11-10 Fri 09:22]--[2023-11-10 Fri 10:17] =>  0:55
CLOCK: [2023-11-10 Fri 08:39]--[2023-11-10 Fri 09:20] =>  0:41
CLOCK: [2023-11-10 Fri 08:32]--[2023-11-10 Fri 08:39] =>  0:07
CLOCK: [2023-11-09 Thu 09:44]--[2023-11-09 Thu 09:59] =>  0:15
CLOCK: [2023-11-09 Thu 07:53]--[2023-11-09 Thu 08:06] =>  0:13
CLOCK: [2023-11-08 Wed 22:27]--[2023-11-08 Wed 23:09] =>  0:42
CLOCK: [2023-11-08 Wed 22:16]--[2023-11-08 Wed 22:18] =>  0:02
CLOCK: [2023-11-08 Wed 21:25]--[2023-11-08 Wed 21:45] =>  0:20
CLOCK: [2023-11-08 Wed 20:22]--[2023-11-08 Wed 20:48] =>  0:26
CLOCK: [2023-11-08 Wed 20:08]--[2023-11-08 Wed 20:17] =>  0:09
CLOCK: [2023-11-08 Wed 19:25]--[2023-11-08 Wed 20:03] =>  0:38
CLOCK: [2023-11-08 Wed 18:29]--[2023-11-08 Wed 19:15] =>  0:46
CLOCK: [2023-11-08 Wed 17:42]--[2023-11-08 Wed 18:10] =>  0:28
CLOCK: [2023-11-08 Wed 16:33]--[2023-11-08 Wed 17:02] =>  0:29
CLOCK: [2023-11-08 Wed 11:31]--[2023-11-08 Wed 12:13] =>  0:42
CLOCK: [2023-11-08 Wed 09:21]--[2023-11-08 Wed 10:58] =>  1:37
CLOCK: [2023-11-08 Wed 09:02]--[2023-11-08 Wed 09:11] =>  0:09
CLOCK: [2023-11-08 Wed 08:44]--[2023-11-08 Wed 08:52] =>  0:08
CLOCK: [2023-11-08 Wed 07:55]--[2023-11-08 Wed 08:41] =>  0:46
CLOCK: [2023-11-08 Wed 07:01]--[2023-11-08 Wed 07:52] =>  0:51
CLOCK: [2023-11-07 Tue 18:01]--[2023-11-07 Tue 20:07] =>  2:06
CLOCK: [2023-11-07 Tue 17:17]--[2023-11-07 Tue 17:58] =>  0:41
CLOCK: [2023-11-07 Tue 16:24]--[2023-11-07 Tue 16:49] =>  0:25
CLOCK: [2023-11-07 Tue 11:43]--[2023-11-07 Tue 11:58] =>  0:15
CLOCK: [2023-11-07 Tue 11:22]--[2023-11-07 Tue 11:40] =>  0:18
CLOCK: [2023-11-07 Tue 10:48]--[2023-11-07 Tue 11:12] =>  0:24
CLOCK: [2023-11-07 Tue 10:15]--[2023-11-07 Tue 10:43] =>  0:28
CLOCK: [2023-11-07 Tue 09:46]--[2023-11-07 Tue 10:03] =>  0:17
CLOCK: [2023-11-07 Tue 09:20]--[2023-11-07 Tue 09:43] =>  0:23
CLOCK: [2023-11-07 Tue 08:02]--[2023-11-07 Tue 08:33] =>  0:31
CLOCK: [2023-11-07 Tue 07:01]--[2023-11-07 Tue 07:21] =>  0:20
CLOCK: [2023-11-06 Mon 22:14]--[2023-11-06 Mon 22:36] =>  0:22
CLOCK: [2023-11-06 Mon 21:35]--[2023-11-06 Mon 22:06] =>  0:31
CLOCK: [2023-11-06 Mon 21:25]--[2023-11-06 Mon 21:34] =>  0:09
:END:
- [X] Chunk Menu Card down in small sizeable chunks of work
- [X] [#C] reorg docs [6/6]
  - [X] initialise vitepress
    - [X] added config
    - [X] add index.md
    - [X] add .gitignore
    - [X] add markdown checkmark support
  - [X] add Joruney Folder
  - [X] add Monday.md
  - [X] add to config
  - [X] deploy on key3d.surge.sh
  - [X] write emails
- [X] [#C] Add Backend [4/4]
  - [X] Decide Deno or Rust, Deno is the winner
  - [X] SideQuest
    - [X] PBA Answering Mail
    - [X] Going to BMW Production (Day off)
    - [X] Write Thursday.md
  - [X] add journey deno deploy [5/5]
    - [X] add basics
    - [X] Projects thingies
    - [X] Organ Thingies
    - [X] connect to db [5/5]
      - [X] kv
      - [X] dynamoDB
      - [X] FaunaDB
      - [X] Firebase
      - [X] Postgres [7/7]
        - [X] set up local psql
        - [X] add table
        - [X] insert data
        - [X] display local data
        - [X] rewrite it to deno deploy
        - [X] make an api
        - [X] write bash script to test it
    - [X] SideQuest[1/1]
      - [X] check exam
  - [X] Add some sort of Backend API just in case
    - [X] serve stupid json via Deno
      - [X] add oak
      - [X] serve something
      - [X] add routes
      - [X] change to products
      - [X] add post
      - [X] safe in memory
    - [X] add postgress [9/9]
      - [X] connect
      - [X] get value
      - [X] on init set values
      - [X] get value by id
      - [X] add update value
      - [X] add migrations
      - [X] reshuffle project
      - [X] add more migrations
      - [X] complete crud ops
    - [X] update .gitattriubes to detect .ts
    - [X] add minimal working tests
    - [X] write Friday.md
- [X] [#A] Add Smart Contract [13/13]
  - [X] intilaise foundry
  - [X] init playground foundry [23/23]
    - [X] add Basics
    - [X] set up Code Editor for foundry
    - [X] add test
    - [X] add writing tests
    - [X] add cheatcode
    - [X] add forge standard library
    - [X] add traces
    - [X] add fork testing
    - [X] add advanced Testing
      - [X] fuzz testing
      - [X] Invariant Testing
        - [X] read that thing
        - [X] code it
    - [X] add advanced Testing
      - [X] Differential Testing
    - [X] deplying and verify
    - [X] gas tracking
      - [X] gas reports
      - [X] gas snapshots
    - [X] debugger
    - [X] cast
    - [X] Anvil
    - [X] chisel
    - [X] config
    - [X] ci
    - [X] in vs code
    - [X] shell auto
    - [X] static anazlyer
    - [X] integrate hardhat
    - [X] best practices
  - [X] side quest vali[4/4]
    - [X] Dach Call
    - [X] Vali with saro check
    - [X] recompile polka for vali -.-'
    - [X] Vali thing agains, fix telemetry
  - [X] side quest docs[5/5]
    - [X] Write Tuesday.md
    - [X] config index.md
    - [X] add favicon.ico
    - [X] redeploy
    - [X] Write Wednesday.md
  - [X] Scratch a stupid contract out
  - [X] Test it somewhere ( Remix, local,  )
  - [X] Call it somehow
  - [X] loop the calling
  - [X] Deploy it sucessfully somewhere
  - [X] Deploy it on Sepolia and verify via etherscan
    - [[https://sepolia.etherscan.io/address/0x5aa0b5ee61195075df5626244533838d32a097ba#code][Contract Verification]]
  - [X] Decide to Stick to Sepolia
  - [X] redeploy docs to key3d.surge.sh
  - [X] Deploy it on zk Astar [11/11]
    - [X] Wrote [[https://ethereum.stackexchange.com/questions/156282/foundry-astar-zkevm-deployment][Ethereum Stack Exchange Issue]]
    - [X] check rpc urls
    - [X] initialise hardhat playground
      - [X] deploy on Katana
      - [X] flatten it correctly
      - [X] use json input to verify
      - [X] verify it on Katana
      - [X] verify it
    - [X] Get something running on zkEVM
    - [X] do mails
    - [X] try foundry again
    - [X] learn solidity scripting for deployment
    - [X] transfer sol scripting to RamenContract
    - [X] make it work
    - [X] deeeploooyed, yikes
    - [X] write Saturday.md
- [X] [#A] Rough Frontend [20/20]
  - [X] call about cross chain project
  - [X] write Sunday.md
  - [X] Display something on page
  - [X] Connect to a chain via ethers
  - [X] Add ethers
  - [X] get Address
  - [X] send transaction from a to b
  - [X] Get Blocknumber via ethers
  - [X] call with Accelator
  - [X] Display Blocknumber
  - [X] Display Blocknumber subscribely
  - [X] Write Monday.md
  - [X] setup ghc in nvim
  - [X] Get Something from Contract
  - [X] Display something from Contract
  - [X] Call smart contract via ehterscan?!?
  - [X] Call Smart Contract via ethers
  - [X] troublshoot ethers version 6
    - [X] See DevCon Talk to get it
    - [X] follow v6 deep dive from moonbeam, canceld
    - [X] ethers creator wrote back and solved it in 10secons
  - [X] Add button, call on Button Click
  - [X] Declare vicotry for now
- [X] [#C] Get a 3D Model of Ramen from somwhere[0/0]
- [X] [#C] UI/UX [2/2]
  - [X] Check Figma, add cleanup if necessary
  - [X] no clean up, too timeintensive

** TODO [#A] Get necessary running [0/3]
:LOGBOOK:
CLOCK: [2023-11-15 Wed 08:29]
:END:
- [ ] Smart Contract
  - [ ] create Ramen Contract (rough)
- [ ] Frontend
  - [ ] display hologram
  - [ ] make one button for Ramen Smart Contract
- [ ] UiUx
  - [ ] Design Menu Card
- [ ] Docs
  - [ ] Write Tuesday.md
